sudo-heyu/LightClock-team/sdkconfig.defaults.esp32c3
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c3"
CONFIG_BT_ENABLED=y
# CONFIG_BT_BLE_50_FEATURES_SUPPORTED is not set
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# Keep logs on USB Serial/JTAG (UART0 pins are used by this project)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Development behavior: keep awake + always BLE advertising
CONFIG_LIGHT_ALARM_ALWAYS_ON=y
CONFIG_LIGHT_ALARM_DEBUG_DISABLE_DEEP_SLEEP=y
